Config/InformationRegisters/КадровыеПеремещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>КадровыеПеремещения</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Подразделение</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Должность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КадровыеДействия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/КадровыеДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>КадровыеДействия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Найм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перевод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Должность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Подразделение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриёма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уволен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/CommonModules/СотрдудникиОперации/Ext/Module.bsl
&НаСервере
Функция СотрудникСуществует(ФИО) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Сотрудники.Наименование
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Наименование = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", ФИО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи.Следующий();
	
КонецФункции

&НаСервере
Функция СотрудникВШтате(Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КадровыеПеремещенияСрезПоследних.Период,
	|	КадровыеПеремещенияСрезПоследних.Сотрудник,
	|	КадровыеПеремещенияСрезПоследних.Действие
	|ИЗ
	|	РегистрСведений.КадровыеПеремещения.СрезПоследних() КАК КадровыеПеремещенияСрезПоследних
	|ГДЕ
	|	КадровыеПеремещенияСрезПоследних.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.Действие <> Перечисления.КадровыеДействия.Увольнение;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция СотрудникУволен(Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КадровыеПеремещенияСрезПоследних.Период,
	|	КадровыеПеремещенияСрезПоследних.Сотрудник,
	|	КадровыеПеремещенияСрезПоследних.Действие
	|ИЗ
	|	РегистрСведений.КадровыеПеремещения.СрезПоследних КАК КадровыеПеремещенияСрезПоследних
	|ГДЕ
	|	КадровыеПеремещенияСрезПоследних.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.Действие = Перечисления.КадровыеДействия.Увольнение;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ПолучитьИсториюСотрудника(Сотрудник) Экспорт
	
	Если Не РольДоступна("HR_Менеджер") Тогда
		
		Сообщить("Недостаточно прав для получения истории! Обратитесь в HR отдел."); 
		                          
		Возврат Неопределено;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	
	Макет = ПолучитьОбщийМакет("МакетОтчётаПосотруднику");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КадровыеПеремещения.Период,
	|	КадровыеПеремещения.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(КадровыеПеремещения.Регистратор),
	|	КадровыеПеремещения.Действие,
	|	КадровыеПеремещения.Подразделение,
	|	КадровыеПеремещения.Должность,
	|	КадровыеПеремещения.Оклад
	|ИЗ
	|	РегистрСведений.КадровыеПеремещения КАК КадровыеПеремещения
	|ГДЕ
	|	КадровыеПеремещения.Сотрудник.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	// Заполнение заголовка
	ОбластьЗаголовок.Параметры.Сотрудник = Сотрудник.Наименование;
	ОбластьЗаголовок.Параметры.ДатаРождения = Формат(Сотрудник.ДатаРождения, "ДФ=dd.MM.yyyy");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
	
	КонецФункции

&НаСервере	
Функция ПолучитьДанныеСотрудникаПоСсылке(СотрудникСсылка) Экспорт
	
	Если Не ЗначениеЗаполнено(СотрудникСсылка) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ОбъектСотрудник = СотрудникСсылка.ПолучитьОбъект();
	Результат = СоздатьДанныеСотрудника();
	
	Результат.Подразделение = ОбъектСотрудник.Подразделение;
	Результат.Должность = ОбъектСотрудник.Должность;
	Результат.Оклад = ОбъектСотрудник.Оклад;
	Результат.ДатаДокумента = ОбъектСотрудник.ДатаПриёма;
	Результат.ДатаРождения = ОбъектСотрудник.ДатаРождения;
	Результат.Уволен = ОбъектСотрудник.Уволен;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОбновитьДанныеСотрудника(СотрудникСсылка, НовыеДанные) Экспорт
	
	Попытка
		
		СотрудникОбъект = СотрудникСсылка.ПолучитьОбъект();
		
		Если ЗначениеЗаполнено(НовыеДанные.Подразделение) Тогда
			СотрудникОбъект.Подразделение = НовыеДанные.Подразделение;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НовыеДанные.Должность) Тогда
			СотрудникОбъект.Должность = НовыеДанные.Должность;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НовыеДанные.Оклад) Тогда
			СотрудникОбъект.Оклад = НовыеДанные.Оклад;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НовыеДанные.Уволен) Тогда
			СотрудникОбъект.Уволен = НовыеДанные.Уволен;
		КонецЕсли;
		
		СотрудникОбъект.Записать();
		
	Исключение
		
		Сообщить("При сохранении информации о сотруднике произошла ошибка: " + ОписаниеОшибки() + " Обновите данные вручную в справочнике ""Сотрудники""");
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
			
КонецФункции

&НаСервере
Функция СоздатьДанныеСотрудника() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Подразделение", Перечисления.Подразделение.ПустаяСсылка());
	Результат.Вставить("Должность", Перечисления.Должность.ПустаяСсылка());
	Результат.Вставить("Оклад", Неопределено);
	Результат.Вставить("ДатаДокумента", Неопределено);
	Результат.Вставить("ДатаРождения", Неопределено);
	Результат.Вставить("Уволен", Неопределено);
	                                              
	Возврат Результат;	
	
КонецФункции
